{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "%run utils.py"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "cellosaurus_dump_in_dictionary_format = CellosaurusToDictionary(\"../project/test_cellosaurus.txt\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'#15310-LN'"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cellosaurus_dump_in_dictionary_format[\"CVCL_E548\"][\"ID\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "wikidata=QueryingWikidata()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Q54398957'"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "wikidata[\"CVCL_E548\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'/home/lubianat/Documents/cellosaurus-wikidata-bot'"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import os\n",
    "os.chdir(\"/home/lubianat/Documents/cellosaurus-wikidata-bot\")\n",
    "os.getcwd()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "cellosaurus_informations_to_wikidata_ids = correspondance(cellosaurus_dump_in_dictionary_format)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'25400923': 'Q42064754'}"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cellosaurus_informations_to_wikidata_ids[\"references\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "query1=wdi_core.WDItemEngine.execute_sparql_query(\"\"\"SELECT distinct ?item ?taxid WHERE { ?item p:P685 ?node. ?node ps:P685 ?taxid.}\"\"\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'taxid': {'type': 'literal', 'value': '7957'}, 'item': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q123141'}}\n"
     ]
    }
   ],
   "source": [
    "print(query1['results']['bindings'][0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "pubmed = \"25400923\"\n",
    "query=wdi_core.WDItemEngine.execute_sparql_query(\"\"\"SELECT ?item WHERE{?item wdt:P698 '\"\"\"+pubmed+\"\"\"'.}\"\"\")\n",
    "query=query['results']\n",
    "query=query['bindings']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'item': {'type': 'uri',\n",
       "   'value': 'http://www.wikidata.org/entity/Q42064754'}}]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "curl --header 'Authorization: Token dfa3bb5860e36eaad4cc056a6bd196e3e7478cf2' tools.wmflabs.org/fatameh/token/pmid/add/25400923\n",
      "<os._wrap_close object at 0x7f6c1e2c2d30>\n"
     ]
    }
   ],
   "source": [
    "\n",
    "fatameh_command = \"curl --header 'Authorization: Token \"\n",
    "\n",
    "fatameh_token = \"dfa3bb5860e36eaad4cc056a6bd196e3e7478cf2\" + \"' \"\n",
    "\n",
    "fatameh_url = \"tools.wmflabs.org/fatameh/token/pmid/add/\"+ pubmed\n",
    "\n",
    "full_fatameh_command = fatameh_command +  fatameh_token + fatameh_url\n",
    "\n",
    "result=os.popen(full_fatameh_command, \"r\")\n",
    "\n",
    "print(full_fatameh_command)\n",
    "print(result)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "exitresult=result.read().replace('\"', '\\\"')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'<html>\\n<head><title>301 Moved Permanently</title></head>\\n<body bgcolor=\"white\">\\n<center><h1>301 Moved Permanently</h1></center>\\n<hr><center>nginx/1.14.2</center>\\n</body>\\n</html>\\n'"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "exitresult"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "add_reference_to_wikidata('!')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "https://www.wikidata.org/w/api.php\n",
      "Successfully logged in as CellosaurusBot\n"
     ]
    }
   ],
   "source": [
    "from src.local import WDUSER, WDPASS\n",
    "\n",
    "\n",
    "login = wdi_login.WDLogin(WDUSER, WDPASS)\n",
    "\n",
    "        #-----------------SPECIES-------------------------#\n",
    "        #contains all wikidata species items with a NCBI Taxonomy id\n",
    "\n",
    "species=cellosaurus_informations_to_wikidata_ids[\"species\"]\n",
    "\n",
    "        #-----------------REFERENCES-------------------------#\n",
    "        #contains all wikidata references with PubMed or DOI id\n",
    "        \n",
    "references=cellosaurus_informations_to_wikidata_ids[\"references\"]\n",
    "\n",
    "        #-----------------CATEGORIES-------------------------#\n",
    "        #contains all the cellosaurus categories and their wikidata item id\n",
    "            #associated\n",
    "            \n",
    "categories=categories(\"project/category.txt\")\n",
    "\n",
    "        #-----------------DISEASES-------------------------#\n",
    "        #contains all wikidata items with NCI thesaurus id\n",
    "        \n",
    "diseases=cellosaurus_informations_to_wikidata_ids[\"diseases\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "Release=Create_Update(login=login, releaseID=\"Q87574023\", cellosaurus=cellosaurus_dump_in_dictionary_format, wikidata=wikidata, references=references, species=species, categories=categories, diseases=diseases)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "update={}\n",
    "create=[]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CVCL_E548\n"
     ]
    },
    {
     "ename": "NameError",
     "evalue": "name 'file' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m--------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m        Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-33-6d270f5ca96f>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[1;32m     13\u001b[0m                 \u001b[0;32melif\u001b[0m \u001b[0mcell_line\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mRelease\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mwikidata\u001b[0m \u001b[0;32mand\u001b[0m \u001b[0mcell_line\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mupdate\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     14\u001b[0m                     \u001b[0;31m#the cell line is duplicated\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 15\u001b[0;31m                     \u001b[0mfile\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mwrite\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcell_line\u001b[0m\u001b[0;34m+\u001b[0m\u001b[0;34m\"\\t\"\u001b[0m\u001b[0;34m+\u001b[0m\u001b[0mwikidata\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0mcell_line\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m+\u001b[0m\u001b[0;34m\"\\n\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     16\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     17\u001b[0m                 \u001b[0;31m#-----------------CREATE-------------------------#\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mNameError\u001b[0m: name 'file' is not defined"
     ]
    }
   ],
   "source": [
    "for cell_line in cellosaurus_dump_in_dictionary_format:\n",
    "                print(cell_line)\n",
    "\n",
    "                #-----------------UPDATE-------------------------#\n",
    "                if cell_line in Release.wikidata and cell_line not in update:\n",
    "                    # the cell line exist in Wikidata, it needs to be updated.\n",
    "                    print(\"update\")\n",
    "                    update[cell_line]=wikidata[cell_line]\n",
    "                    print(update[cell_line])\n",
    "                    Release.UpdateWikidata(cell_line, Release.InitialisationData(cell_line))\n",
    "\n",
    "                #-----------------DUPLICATE-------------------------#\n",
    "                elif cell_line in Release.wikidata and cell_line in update:\n",
    "                    #the cell line is duplicated\n",
    "                    file.write(cell_line+\"\\t\"+wikidata[cell_line]+\"\\n\")\n",
    "\n",
    "                #-----------------CREATE-------------------------#\n",
    "                else:\n",
    "                    #the cell line does not exist in Wikidata, it needs to be\n",
    "                        #created.\n",
    "                    print(\"create\")\n",
    "                    create.append(cell_line)\n",
    "                    Release.InsertionWikidata(cell_line, Release.InitialisationData(cell_line))\n",
    "                \n",
    "                break\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'data': [<wikidataintegrator.wdi_core.WDItemID at 0x7f6c260bc470>,\n",
       "  <wikidataintegrator.wdi_core.WDItemID at 0x7f6c260bc320>,\n",
       "  <wikidataintegrator.wdi_core.WDExternalID at 0x7f6c260bc898>],\n",
       " 'data_to_delete': ['P31',\n",
       "  'P5166',\n",
       "  'P3432',\n",
       "  'P3578',\n",
       "  'P2888',\n",
       "  'P2888',\n",
       "  'P2888',\n",
       "  'P2888',\n",
       "  'P486',\n",
       "  'P1343']}"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "Release.InitialisationData(\"CVCL_E548\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "P31 not found in fastrun\n",
      "2020-05-03 20:17:39.302685: maxlag. sleeping for 7.3 seconds\n",
      "2020-05-03 20:17:46.861046: maxlag. sleeping for 7.3 seconds\n",
      "2020-05-03 20:17:54.435396: maxlag. sleeping for 7.3 seconds\n",
      "2020-05-03 20:18:02.014406: maxlag. sleeping for 7.3 seconds\n",
      "2020-05-03 20:18:09.599863: maxlag. sleeping for 6.4 seconds\n",
      "2020-05-03 20:18:16.390133: maxlag. sleeping for 6.4 seconds\n",
      "2020-05-03 20:18:23.047433: maxlag. sleeping for 6.4 seconds\n",
      "2020-05-03 20:18:29.713647: maxlag. sleeping for 6.4 seconds\n",
      "2020-05-03 20:18:36.417154: maxlag. sleeping for 6.4 seconds\n"
     ]
    },
    {
     "ename": "KeyboardInterrupt",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m--------------------------------------------------\u001b[0m",
      "\u001b[0;31mKeyboardInterrupt\u001b[0mTraceback (most recent call last)",
      "\u001b[0;32m<ipython-input-21-8ddca5c03667>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0mRelease\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mInsertionWikidata\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"CVCL_E548\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mRelease\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mInitialisationData\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"CVCL_E548\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;32m~/Documents/cellosaurus-wikidata-bot/src/utils.py\u001b[0m in \u001b[0;36mInsertionWikidata\u001b[0;34m(self, Item, data)\u001b[0m\n\u001b[1;32m    350\u001b[0m         \u001b[0;32mwith\u001b[0m \u001b[0mopen\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"results/WikidataID.txt\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m\"a\"\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0mfile\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    351\u001b[0m             file.write(item.write(self.login, bot_account=False, edit_summary=\"create item {}\".format(\n\u001b[0;32m--> 352\u001b[0;31m                 self.cellosaurus[Item][\"ID\"]))+\"\\t\"+Item+\"\\n\")\n\u001b[0m\u001b[1;32m    353\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    354\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mUpdateWikidata\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mItem\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mdata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/.local/lib/python3.6/site-packages/wikidataintegrator/wdi_core.py\u001b[0m in \u001b[0;36mwrite\u001b[0;34m(self, login, bot_account, edit_summary, entity_type, property_datatype, max_retries, retry_after)\u001b[0m\n\u001b[1;32m    942\u001b[0m             json_data = self.mediawiki_api_call('POST', self.mediawiki_api_url, session=login.get_session(),\n\u001b[1;32m    943\u001b[0m                                                 \u001b[0mmax_retries\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mmax_retries\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mretry_after\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mretry_after\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 944\u001b[0;31m                                                 headers=headers, data=payload)\n\u001b[0m\u001b[1;32m    945\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    946\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0;34m'error'\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mjson_data\u001b[0m \u001b[0;32mand\u001b[0m \u001b[0;34m'messages'\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mjson_data\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'error'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/.local/lib/python3.6/site-packages/wikidataintegrator/wdi_core.py\u001b[0m in \u001b[0;36mmediawiki_api_call\u001b[0;34m(method, mediawiki_api_url, session, max_retries, retry_after, **kwargs)\u001b[0m\n\u001b[1;32m   1017\u001b[0m                     \u001b[0msleep_sec\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mjson_data\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'error'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'lag'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mretry_after\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1018\u001b[0m                     \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"{}: maxlag. sleeping for {} seconds\"\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mformat\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mdatetime\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdatetime\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mutcnow\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msleep_sec\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1019\u001b[0;31m                     \u001b[0mtime\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msleep\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msleep_sec\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1020\u001b[0m                     \u001b[0;32mcontinue\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1021\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m: "
     ]
    }
   ],
   "source": [
    "Release.InsertionWikidata(\"CVCL_E548\", Release.InitialisationData(\"CVCL_E548\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'self' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m--------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m        Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-35-14870346a13a>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0mSet\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcellosaurus\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mItem\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'name'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m: name 'self' is not defined"
     ]
    }
   ],
   "source": [
    "Set(self.cellosaurus, Item)['name']\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "release=wdi_core.WDItemEngine(wd_item_id=\"Q87574023\").get_label()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Cellosaurus release 34'"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "release"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
